lib/tasks/parse_ledger.rake

INSERT INTO "transactions" ("activity_id", "date", "transaction_type", "method", "amount", "balance", "created_at", "updated_at", "requester_type", "source_type", "source_id", "source_description", "destination_type", "destination_id", "destination_description") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
          transaction[:destination_description] = entry['destination']['description']
        end

        transaction.save

DELETE FROM "transactions"
---
  task concatenated_task: :environment do
    # Clear existing transactions (optional)
    EquityTransaction.delete_all