app/helpers/ledger_helper.rb

  def min_transaction_date
    EquityTransaction.minimum(:date).strftime("%m/%d/%Y") if EquityTransaction.first
---
SELECT  "transactions".* FROM "transactions" ORDER BY "transactions"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT MIN("transactions"."date") FROM "transactions"

  def max_transaction_date
    EquityTransaction.maximum(:date).strftime("%m/%d/%Y") if EquityTransaction.first
---
SELECT  "transactions".* FROM "transactions" ORDER BY "transactions"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT MAX("transactions"."date") FROM "transactions"