app/controllers/ledger_controller.rb

SELECT MIN("transactions"."date") FROM "transactions"
SELECT  DISTINCT "transactions".* FROM "transactions" ORDER BY "transactions"."date" DESC LIMIT ?  [["LIMIT", 1]]
---
  def display
    @transactions = Transaction.order(date: :desc).distinct
    @balance = @transactions.first ? @transactions.first.balance : 0

INSERT INTO "transactions" ("activity_id", "date", "transaction_type", "method", "amount", "balance", "created_at", "updated_at", "requester_type", "source_type", "source_id", "source_description", "destination_type", "destination_id", "destination_description") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def upload_file
    file = params[:ledger_file]
    if file.present? && file.content_type == 'application/json'
      json_data = file.read
      ledger_entries = JSON.parse(json_data)
      # Process and save the ledger_entries as transactions
      ledger_entries.each do |entry|
        transaction = Transaction.new(
          activity_id: entry['activity_id'],
          date: entry['date'],
          transaction_type: entry['type'],
          method: entry['method'],
          amount: entry['amount'],
          balance: entry['balance']
        )
        if entry['requester']
          transaction[:requester_type] = entry['requester']['type']
        end

        if entry['source']
          transaction[:source_type] = entry['source']['type'],
          transaction[:source_id]  = entry['source']['id'],
          transaction[:source_description] = entry['source']['description']
        end
        if entry['destination']
          transaction[:destination_type] = entry['destination']['type'],
          transaction[:destination_id] = entry['destination']['id'],
          transaction[:destination_description] = entry['destination']['description']
        end

        transaction.save